## 1.Trunk port (https://vnpro.vn/thu-vien/cong-truy-nhap-access-va-trung-ke-trunk-tren-switch-2133.html)
- Trunk port là một kết nối vật lý và logic để hỗ trợ các VLAN trên các Switch liên kết với nhau.
- Trunk port cho phép frame của nhiều VLAN có thể truyền trên đó. Một cổng trunking không được gán cho một VLAN riêng biệt.
- Trunk port thường được dùng để kết nối giữa các Switch hoặc giữa Switch và Router. Chính vì vậy cổng trunking thường là cổng có băng thông lớn
- Các VLAN được ghép kênh qua cổng trunk. Để ghép kênh lưu lượng của các VLAN, một giao thức đặc biệt sẽ được sử dụng để đóng gói frame để thiết bị có thể xác định được nó thuộc VLAN nào. Chuẩn frame được sử dụng đó là 802.1Q hoặc ISL.
- Nhờ cổng trunking mà một VLAN có thể được mở rộng ra toàn mạng.
- Cấu hình trunk port:
	Đối với sw-layer 2:
```Switch(config)#int f0/24
Switch(config-if)#switchport mode trunk
Switch(config-if)#
```
	Đối với sw-layer 3:
```
Switch(config)#int f0/1
Switch(config-if)#switchport trunk encapsulation dot1q 
Switch(config-if)#switchport mode trunk
Switch(config-if)#
```

## 2. Add and remove VLAN on trunk
- Add vlan vào cổng trunk
```Switch(config)#int f0/1
Switch(config-if)#switchport trunk allowed vlan 10
Switch(config)#do sh run
Building configuration...

Current configuration : 1202 bytes
!
version 12.2
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
spanning-tree mode pvst
!
interface FastEthernet0/1
 switchport trunk allowed vlan 10
 switchport mode trunk
!
interface FastEthernet0/2
```

``` Switch(config)#int f0/1
Switch(config-if)#switchport trunk allowed vlan add 20
Switch(config-if)#do sh run
Building configuration...

Current configuration : 1205 bytes
!
version 12.2
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
spanning-tree mode pvst
!
interface FastEthernet0/1
 switchport trunk allowed vlan 10,20
 switchport mode trunk
!
interface FastEthernet0/2
```
- Remove vlan khỏi cổng trunk
```Switch(config-if)#switchport trunk allowed vlan remove 10
Switch(config-if)#do sh run
Building configuration...

Current configuration : 1202 bytes
!
version 12.2
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
spanning-tree mode pvst
!
interface FastEthernet0/1
 switchport trunk allowed vlan 20
 switchport mode trunk
!
interface FastEthernet0/2
```

## 3. DTP (dynamic trunking protocol) and configre (https://www.quora.com/What-is-Dynamic-Trunking-Protocol-DTP; https://www.internetworks.in/2018/12/dynamic-trunking-protocol-dtp-and.html)
- Cisco đã triển khai một giao thức point-to-point độc quyền gọi là giao thức Trunking động (DTP) để đàm phán chế độ trunking giữa hai switch. DTP được sử dụng trên các switch IOS của Cisco để đàm phán nếu cổng trên switch trở thành cổng truy cập hoặc cổng trunk.
- Theo mặc định, Giao thức DTP được bật và giao diện của các switch sẽ ở chế độ (tự động) hoặc (mong muốn). Điều đó có nghĩa là bất cứ khi nào chúng tôi nhận được gói DTP yêu cầu tạo liên kết trunk, giao diện của bạn sẽ ở chế độ trunking.
- DTP mode:
	<ul>
	<li>Desirable: chế độ này luôn muốn là một liên kết trunking. Chế độ Desirable gửi và trả lời (trả lời) cho các tin nhắn DTP. Chế độ này có thể trở thành trunking khi phía bên kia của switch được đặt thành trunking.</li>
	<li>Auto: Chế độ này chỉ trả lời các tin nhắn DTP nhưng nó không được gửi, chế  độ này chỉ là chế độ mặc định của hầu hết các thiết bị switch, để chuyển thành một liên kết trunking thì các switch khác liên kết với nó phải set là một trunk hoặc ở chế độ dynamic desirable.</li>
	<li>Trunk: Chế độ set trunking thủ công bằng câu lệnh **switchport mode trunk**, port này sẽ đàm phán một liên kết trunking với switch lân cận mà nó kết nối đến.</li>
	<li>Access: port chỉ set thủ công bằng câu lệnh **switchport mode access**, mục đích để cho người dùng có thể sử dụng cổng đó ở trong một vlan</li>
	<li>No-Negotiate: được xem như chế độ DTP bị vô hiệu, sẽ không có một tin nhắn DTP nào được thực hiện, cổng vẫn là một cổng trunk nhưng nó sẽ không thực hiện bất kì một đàm phán DTP nào</li>
	</ul>
- Cấu hình 
```Switch(config)#int f0/24
Switch(config-if)#switchport mode ?
  access   Set trunking mode to ACCESS unconditionally
  dynamic  Set trunking mode to dynamically negotiate access or trunk mode
  trunk    Set trunking mode to TRUNK unconditionally
Switch(config-if)#switchport mode dynamic ?
  auto       Set trunking mode dynamic negotiation parameter to AUTO
  desirable  Set trunking mode dynamic negotiation parameter to DESIRABLE
Switch(config-if)#switchport mode dynamic 
``` 

## 4. VTP (Vlan trunking protocol v1&v2) (https://vnpro.vn/tin-tuc/khai-niem-va-phan-loai-vtp-mode-935.html; http://www.econfigs.com/ccna-2-5-c-vtp-v1-and-v2-vlan-trunking-protocol-vtp/)
- VTP giúp cho việc cấu hình VLAN luôn đồng nhất khi thêm, xóa, sửa thông tin về VLAN trong một hệ thống mạng. VTP được thiết lập để giải quyết các vấn đề nằm bên trong hoạt động của môi trường mạng VLAN.
- Để cấu hình VTP cho các switch ta cần có VTP domain và password. Switch sẽ có 3 chế độ hoạt động của VTP:
	<ul>
	<li>Server: Cơ sở dữ liệu thông tin chính của vlans và gửi thông tin cấu hình vlan ra hệ thống</li>
	<li>Client: nhận updates từ server, chỉnh sửa thông tin vlans trên database và chuyển tiếp tin nhắn VTP</li>
	<li>Transparent: Nhận updates từ server nhưng không thực hiện chỉnh sửa trên databases của switch đó, thực hiện chuyển tiếp tin nhắn VTP</li>
	</ul>
- Cấu hình:
	- Tạo các vlan trên một switch đóng vai trò làm VTP server
```Switch(config)#vlan 10
Switch(config-vlan)#name student
Switch(config-vlan)#vlan 20
Switch(config-vlan)#name staff
Switch(config-vlan)#vlan 30
Switch(config-vlan)#name guest
Switch(config-vlan)#exit
Switch(config)#do sh vl br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
10   student                          active    
20   staff                            active    
30   guest                            active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch(config)#
```

- Tiến hành trunking các port kết nối với các switch và tạo vtp server

```Switch(config)#int range f0/1-3
Switch(config-if-range)#switchport mode trunk



Switch(config-if-range)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up

Switch(config-if-range)#exit
Switch(config)#vtp domain truong
Changing VTP domain name from NULL to truong
Switch(config)#vtp password 123
Setting device VLAN database password to 123
Switch(config)#vtp mode server
Device mode already VTP SERVER.
Switch(config)#do sh vtp status
VTP Version                     : 2
Configuration Revision          : 0
Maximum VLANs supported locally : 255
Number of existing VLANs        : 8
VTP Operating Mode              : Server
VTP Domain Name                 : truong
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x2C 0xDC 0xE9 0x28 0x3F 0xA3 0x4F 0x77 
Configuration last modified by 0.0.0.0 at 3-1-93 00:01:48
Local updater ID is 0.0.0.0 (no valid interface found)
Switch(config)#
```

- Tạo các vtp client trên các switch khác kết nối đến vtp server
```Switch(config)#vtp domain truong
Domain name already set to truong.
Switch(config)#vtp password 123
Setting device VLAN database password to 123
Switch(config)#vtp mode client
Setting device to VTP CLIENT mode.
Switch(config)#do sh vtp status
VTP Version                     : 2
Configuration Revision          : 0
Maximum VLANs supported locally : 255
Number of existing VLANs        : 8
VTP Operating Mode              : Client
VTP Domain Name                 : truong
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x2C 0xDC 0xE9 0x28 0x3F 0xA3 0x4F 0x77 
Configuration last modified by 0.0.0.0 at 3-1-93 00:01:48
Switch(config)#
```

- Sau khi tạo vtp server và vtp client, ta tiến hành kiểm tra các vlan đã được đồng bộ từ server xuống client hay chưa bằng các show vlan trên client.

```Switch(config)#do sh vl br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/2, Fa0/3, Fa0/4, Fa0/5
                                                Fa0/6, Fa0/7, Fa0/8, Fa0/9
                                                Fa0/10, Fa0/11, Fa0/12, Fa0/13
                                                Fa0/14, Fa0/15, Fa0/16, Fa0/17
                                                Fa0/18, Fa0/19, Fa0/20, Fa0/21
                                                Fa0/22, Fa0/23, Fa0/24
10   student                          active    
20   staff                            active    
30   guest                            active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch(config)#
```
## 5. Chuẩn 802.1q và native vlan
### 5.1. Chuẩn 802.1q (https://vnpro.vn/thu-vien/giao-thuc-8021q-trong-cong-trung-ke-2140.html)
- 802.1Q là một giao thức cho phép một liên kết vật lý có thể thực hiện mang lưu lượng của nhiều VLAN. Đây là tiêu chuẩn VLAN trunking protocol của IEEE.
- IEEE 802.1Q là một chuẩn chung dùng để nhận dạng các VLAN được truyền qua đường trunking, nó hoạt động trong môi trường Ethernet và là một chuẩn mở. Là giao thức dùng gán nhãn frame khi truyền frame trên đường trunking giữa hai Switch hay giữa Switch và Router, việc gán nhãn frame được thực hiện bằng cách thêm thông tin VLAN ID vào phần giữa header trước khi frame được truyền lên đường trunking. Nó cho phép VLAN đi qua đường liên kết bất chấp việc nhiều hãng sản xuất tồn tại.
- Giao thức 802.1Q có những tính năng sau:
	<ul>
	<li>Hỗ trợ cho Ethernet và Token Ring</li>
	<li>Hỗ trợ cho 4096 VLAN</li>
	<li>Hỗ trợ cho common spanning tree (CST), mutiple spanning tree protocol (MSTP), Rapid spanning tree protocol (RSTP)</li>
	<li>Hỗ trợ point-to-multipoint topology</li>
	<li>Hỗ trợ cho lưu lượng untagged trên đường trunking thông qua Native Vlan</li>
	<li>Mở rộng hỗ trợ QoS</li>
	<li>Tăng tiêu chuẩn cho liên kết điện thoại IP</li>
	</ul>
### 5.2. Native VLAN (http://svuit.vn/threads/native-vlan-and-private-vlan-658/)
- Native VLAN là một VLAN có các cổng được cấu hình trunk.
- Tất cả các frame thuộc VLAN khi đi qua đường trunk sẽ được gắn thẻ “tag” giao thức IEEE 802.1Q và ISL, ngoại trừ các đối tuợng thuộc VLAN 1. Những frame thuộc Native VLAN sẽ không cần gắn “tag” khi đi trên đường trunk. Như vậy, theo mặc định các đối tuợng của VLAN 1 khi đi qua đường trunk sẽ không được gắn thẻ.
- Tác dụng của native vlan:
	<ul>
	<li>Native VLAN giúp giảm khả năng xử lý cho hệ thống</li>
	<li>cho phép các cổng hiểu 802.1Q giao tiếp được với các cổng cũ không hiểu 802.1Q hay các thiết bị không được hỗ trợ VLAN như Hub, Repeater ( những thiết bị thuộc tầng 1 ) ... bằng cách gửi và nhận trực tiếp các luồng dữ liệu không được gắn tag</li>
	<li>Thường dùng cho mục đích quản lý khi cần cấu hình thiết bị từ xa.</li>
	</ul>
- Chuyển native vlan mặc định thành một vlan khác
`Switch(config-if)#switchport trunk native vlan vlan-id`
